DominoTree/freebsd-src/share/man/man4/aq.4
.\"
.\" Copyright (c) 2025 The FreeBSD Foundation
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd August 6, 2026
.Dt AQ 4
.Os
.Sh NAME
.Nm aq
.Nd Aquantia / Marvell AQC1xx Ethernet driver
.Sh SYNOPSIS
To compile this driver into the kernel, place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device aq"
.Ed
.Pp
To load the driver as a module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
if_aq_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
device driver provides support for PCIe 1/2.5/5/10 Gigabit Ethernet adapters
based on
Aquantia (now Marvell) AQtion AQC1xx Ethernet controllers.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Pp
The
.Nm
driver is experimental, and has a number of caveats and limitations.
.Sh HARDWARE
The
.Nm
driver supports the following PCIe Ethernet controllers:
.Pp
.Bl -bullet -compact
.It
aQuantia AQC100 (100Mb/1Gb/2.5Gb/5Gb/10Gb SFP+)
.It
aQuantia AQC100S (100Mb/1Gb/2.5Gb/5Gb/10Gb SFP+)
.It
aQuantia AQC107 (100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
aQuantia AQC107S (100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
aQuantia AQC108 (100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
aQuantia AQC108S (100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
aQuantia AQC109 (100Mb/1Gb/2.5Gb RJ45)
.It
aQuantia AQC109S (100Mb/1Gb/2.5Gb RJ45)
.It
aQuantia AQC111 (100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
aQuantia AQC111S (100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
aQuantia AQC112 (100Mb/1Gb/2.5Gb RJ45)
.It
aQuantia AQC112S (100Mb/1Gb/2.5Gb RJ45)
.It
Marvell AQC113 (10Mb/100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
Marvell AQC113C (10Mb/100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
Marvell AQC113CA (10Mb/100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
Marvell AQC113CS (10Mb/100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
Marvell AQC114CS (10Mb/100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
Marvell AQC115C (10Mb/100Mb/1Gb/2.5Gb RJ45)
.It
Marvell AQC116C (10Mb/100Mb/1Gb RJ45)
.El
.Sh SYSCTL VARIABLES
The following read-only variables are available per interface as
.Va dev.aq.%d.%s ,
where
.Ar %d
is the interface number.
Each is present only when the adapter's firmware supports it.
.Bl -tag -width indent
.It Va temperature
The PHY die temperature.
.It Va fw_link_up
The number of link up transitions counted by the firmware.
.It Va fw_link_down
The number of link down transitions counted by the firmware.
Comparing this against the transitions logged by the driver
distinguishes a single link event from a flapping link.
.El
.Pp
The following variable runs a cable diagnostic.
It is present only on adapters whose firmware provides one:
.Bl -tag -width indent
.It Va cable_diag
Writing any value runs a time-domain reflectometry test and stores the
result; reading reports the result of the last run.
The test drives pulses down each of the four pairs, so it
.Em interrupts an established link
for several seconds.
Each pair is reported as
.Dq ok ,
.Dq short ,
.Dq open ,
a low or high impedance mismatch, or a crossover to another named pair.
A pair that is not
.Dq ok
also reports the approximate distance to the fault and to the far end,
in metres.
Only one test runs at a time; a write issued while one is already running
fails with
.Er EBUSY .
A write blocks until the test finishes and can be interrupted.
.El
.Pp
The following variables tune the driver's own tracing:
.Bl -tag -width indent
.It Va debug
Trace verbosity: 0 disables tracing, 3 reports errors, 4 adds warnings,
5 adds traces and 6 adds detail.
The default is 3.
.It Va debug_categories
Bit mask selecting the traced categories: init 1, config 2, tx 4, rx 8,
intr 16 and fw 32.
All categories are enabled by default.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr miibus 4 ,
.Xr ifconfig 8
