DominoTree/freebsd-src/share/man/man4/aq.4
.\"
.\" Copyright (c) 2025 The FreeBSD Foundation
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd August 15, 2026
.Dt AQ 4
.Os
.Sh NAME
.Nm aq
.Nd Aquantia / Marvell AQC1xx Ethernet driver
.Sh SYNOPSIS
To compile this driver into the kernel, place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device aq"
.Ed
.Pp
To load the driver as a module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
if_aq_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
device driver provides support for PCIe 1/2.5/5/10 Gigabit Ethernet adapters
based on
Aquantia (now Marvell) AQtion AQC1xx Ethernet controllers.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Pp
The
.Nm
driver is experimental, and has a number of caveats and limitations.
.Sh HARDWARE
The
.Nm
driver supports the following PCIe Ethernet controllers:
.Pp
.Bl -bullet -compact
.It
aQuantia AQC100 (100Mb/1Gb/2.5Gb/5Gb/10Gb SFP+)
.It
aQuantia AQC100S (100Mb/1Gb/2.5Gb/5Gb/10Gb SFP+)
.It
aQuantia AQC107 (100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
aQuantia AQC107S (100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
aQuantia AQC108 (100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
aQuantia AQC108S (100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
aQuantia AQC109 (100Mb/1Gb/2.5Gb RJ45)
.It
aQuantia AQC109S (100Mb/1Gb/2.5Gb RJ45)
.It
aQuantia AQC111 (100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
aQuantia AQC111S (100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
aQuantia AQC112 (100Mb/1Gb/2.5Gb RJ45)
.It
aQuantia AQC112S (100Mb/1Gb/2.5Gb RJ45)
.It
Marvell AQC113 (10Mb/100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
Marvell AQC113C (10Mb/100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
Marvell AQC113CA (10Mb/100Mb/1Gb/2.5Gb/5Gb/10Gb RJ45)
.It
Marvell AQC113CS (10Mb/100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
Marvell AQC114CS (10Mb/100Mb/1Gb/2.5Gb/5Gb RJ45)
.It
Marvell AQC115C (10Mb/100Mb/1Gb/2.5Gb RJ45)
.It
Marvell AQC116C (10Mb/100Mb/1Gb RJ45)
.El
.Sh PLUGGABLE MODULES
On the SFP+ adapters
.Nm
reads the module's SFF-8472 memory over the firmware's SMBus proxy, so
.Xr ifconfig 8
.Fl v
reports the module's type, vendor, part and serial number and date code,
and, on a module that supports digital diagnostics, its temperature,
supply voltage, laser bias current and optical power.
.Pp
Only the Atlantic 1 firmware carries that proxy.
The equivalent Atlantic 2 adapter reports nothing at all, which is easy to
mistake for an empty or a faulty cage.
Reads are refused on the twisted pair adapters, which have no cage to
address.
.Pp
The media an SFP+ adapter reports follows the module actually fitted
rather than the cage.
Until a module has been read each speed goes by its medium-neutral host
interface name, such as
.Dq 10Gbase-SFI ,
and once one has been read the speed is reported as
.Dq 10Gbase-SR ,
.Dq 10Gbase-LR ,
.Dq 10Gbase-LRM ,
.Dq 10GBase-ER ,
.Dq 10Gbase-Twinax
or
.Dq 10Gbase-T
as the module states, and correspondingly at the lower speeds.
The advertised list holds every name each supported speed can go by, so
a media selection made before a module is fitted keeps working after,
and a speed with no pluggable equivalent, such as 5Gb, keeps its
twisted pair name in a cage rather than becoming unselectable.
.Sh SYSCTL VARIABLES
The following read-only variables are available per interface as
.Va dev.aq.%d.%s ,
where
.Ar %d
is the interface number.
Each is present only when the adapter's firmware supports it.
.Bl -tag -width indent
.It Va temperature
The PHY die temperature.
.It Va fw_link_up
The number of link up transitions counted by the firmware.
.It Va fw_link_down
The number of link down transitions counted by the firmware.
Comparing this against the transitions logged by the driver
distinguishes a single link event from a flapping link.
.El
.Pp
The following variable runs a cable diagnostic.
It is present only on adapters that support one:
.Bl -tag -width indent
.It Va cable_diag
Writing any value runs a time-domain reflectometry test and stores the
result; reading reports the result of the last run.
The test drives pulses down each of the four pairs, so it
.Em interrupts an established link
for ten to twenty seconds, counting renegotiation.
That interruption is a genuine link state transition, not a cosmetic one:
a
.Xr carp 4
master on the interface demotes and fails over, a
.Xr lagg 4
port leaves the aggregation and has to negotiate its way back in, and an
.Xr if_bridge 4
member goes down and up again.
The link-down message names the diagnostic as the cause.
Each pair is reported as
.Dq ok ,
.Dq short ,
.Dq open ,
a low or high impedance mismatch, or a crossover to another pair.
A pair that is not
.Dq ok
also reports the approximate distance to the fault in metres.
.El
.Pp
The following variables tune the driver's own tracing:
.Bl -tag -width indent
.It Va debug
Trace verbosity: 0 disables tracing, 3 reports errors, 4 adds warnings,
5 adds traces and 6 adds detail.
The default is 3.
.It Va debug_categories
Bit mask selecting the traced categories: init 1, config 2, tx 4, rx 8,
intr 16 and fw 32.
All categories are enabled by default.
.El
.Sh SEE ALSO
.Xr arp 4 ,
.Xr carp 4 ,
.Xr if_bridge 4 ,
.Xr lagg 4 ,
.Xr miibus 4 ,
.Xr ifconfig 8
