DominoTree/freebsd-src/share/man/man4/aq.4
.\" Copyright (c) 2025 The FreeBSD Foundation
.\"
.\" SPDX-License-Identifier: BSD-2-Clause
.\"
.Dd July 9, 2026
.Dt AQ 4
.Os
.Sh NAME
.Nm aq
.Nd Aquantia / Marvell AQC1xx Ethernet driver
.Sh SYNOPSIS
To compile this driver into the kernel, place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device aq"
.Ed
.Pp
To load the driver as a module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
if_aq_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
device driver provides support for PCIe 1/2.5/5/10 Gigabit Ethernet adapters
based on
Aquantia (now Marvell) AQtion AQC1xx Ethernet controllers.
.Pp
For more information on configuring this device, see
.Xr ifconfig 8 .
.Pp
The
.Nm
driver is experimental, and has a number of caveats and limitations.
.Sh HARDWARE
The
.Nm
driver supports the following PCIe Ethernet controllers:
.Bl -column "aQuantia AQC100" "Maximum speed"
.It Em "Controller" Ta Em "Maximum speed"
.It "aQuantia AQC100" Ta "10 Gigabit"
.It "aQuantia AQC107" Ta "10 Gigabit"
.It "aQuantia AQC108" Ta "5 Gigabit"
.It "aQuantia AQC109" Ta "2.5 Gigabit"
.It "aQuantia AQC111" Ta "5 Gigabit"
.It "aQuantia AQC112" Ta "2.5 Gigabit"
.It "Marvell AQC113" Ta "10 Gigabit"
.It "Marvell AQC114" Ta "5 Gigabit"
.It "Marvell AQC115" Ta "2.5 Gigabit"
.It "Marvell AQC116" Ta "1 Gigabit"
.El
.Pp
Suffixed variants of these controllers, such as
.Dq AQC107S
or
.Dq AQC113CS ,
are also supported and share the maximum speed of the base part.
The AQC100 is an SFP+ controller; the remainder use twisted-pair media.
.Pp
Only the AQC113 through AQC116 support 10 Megabit operation;
the remaining controllers negotiate no slower than 100 Megabit.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr miibus 4 ,
.Xr ifconfig 8
.Sh CAVEATS
Many AQC111 and AQC112 units shipped with the PHY IEEE 1588 block enabled,
where it corrupts the receive datapath.
The
.Nm
driver disables that block when the interface is brought up.
The setting persists in the PHY until the adapter loses power, so it also
affects other operating systems booted without an intervening power cycle.
