DominoTree/freebsd-src/share/man/man9/iflibdd.9
.Dd September 19, 2026
.Dt IFLIBDD 9
.Os
.Sh NAME
.Nm iflibdd
.Nd Device Dependent Configuration Functions
.Sh SYNOPSIS
.In "ifdi_if.h"
.Ss "Soft Queue Setup and Teardown Functions"
.Ss "Mandatory Functions"
.Ft int
.Fo ifdi_tx_queues_alloc
.Fa "if_ctx_t ctx"
.Fa "caddr_t *vaddrs"
.Fa "uint64_t *paddrs"
.Fa "int ntxqs"
.Fa "int ntxqsets"
.Fc
.Ft int
.Fo ifdi_rx_queues_alloc
.Fa "if_ctx_t ctx"
.Fa "caddr_t *vaddrs"
.Fa "uint64_t *paddrs"
.Fa "int nrxqs"
.Fa "int nrxqsets"
.Fc
.Ft int
.Fo ifdi_queues_free
.Fa "if_ctx_t ctx"
.Fc
.Ss "Optional Functions"
.Ft int
.Fo ifdi_txq_setup
.Fa "if_ctx_t ctx"
.Fa "uint16_t qid"
.Fc
.Ft int
.Fo ifdi_rxq_setup
.Fa "if_ctx_t ctx"
.Fa "uint16_t qid"
.Fc
.Ss "Device Setup and Teardown Functions"
.Ss "Mandatory Functions"
.Ft int
.Fo ifdi_attach_pre
.Fa "if_ctx_t ctx"
.Fc
.Ft int
.Fo ifdi_attach_post
.Fa "if_ctx_t ctx"
.Fc
.Ft int
.Fo ifdi_detach
.Fa "if_ctx_t ctx"
.Fc
.Ss "Optional Functions"
.Ft void
.Fo ifdi_vlan_register
.Fa "if_ctx_t ctx"
.Fa "uint16_t vtag"
.Fc
.Ft void
.Fo ifdi_vlan_unregister
.Fa "if_ctx_t ctx"
.Fa "uint16_t vtag"
.Fc
.Ft int
.Fo ifdi_power_prepare
.Fa "if_ctx_t ctx"
.Fa "enum iflib_power_event event"
.Fc
.Ft int
.Fo ifdi_suspend
.Fa "if_ctx_t ctx"
.Fc
.Ft int
.Fo ifdi_shutdown
.Fa "if_ctx_t ctx"
.Fc
.Ft int
.Fo ifdi_resume
.Fa "if_ctx_t ctx"
.Fc
.Ss "Device Configuration Functions"
.Ss "Mandatory Functions"
.Ft void
.Fo ifdi_init
.Fa "if_ctx_t ctx"
.Fc
.Ft void
.Fo ifdi_stop
.Fa "if_ctx_t ctx"
.Fc
.Ft void
.Fo ifdi_multi_set
.Fa "if_ctx_t ctx"
.Fc
.Ft int
.Fo ifdi_mtu_set
.Fa "if_ctx_t ctx"
.Fa "uint32_t mtu"
.Fc
.Ft void
.Fo ifdi_media_status
.Fa "if_ctx_t ctx"
.Fa "struct ifmediareq *ifr"
.Fc
.Ft int
.Fo ifdi_media_change
.Fa "if_ctx_t ctx"
.Fc
.Ft void
.Fo ifdi_promisc_set
.Fa "if_ctx_t ctx"
.Fa "int flags"
.Fc
.Ft uint64_t
.Fo ifdi_get_counter
.Fa "if_ctx_t ctx"
.Fa "ift_counter cnt"
.Fc
.Ft void
.Fo ifdi_update_admin_status
.Fa "if_ctx_t ctx"
.Fc
.Ss "Optional Functions"
.Ft void
.Fo ifdi_media_set
.Fa "if_ctx_t ctx"
.Fc
.Ss "Interrupt enable/disable"
.Ss "Mandatory Functions"
.Ft void
.Fo ifdi_intr_enable
.Fa "if_ctx_t ctx"
.Fc
.Ft void
.Fo ifdi_queue_intr_enable
.Fa "if_ctx_t ctx"
.Fa "uint16_t qid"
.Fc
.Ft void
.Fo ifdi_intr_disable
.Fa "if_ctx_t ctx"
.Fc
.Ss IOV Support
.Ft init
.Fo iov_init
.Fa "if_ctx_t ctx"
.Fa "uint16_t num_vfs"
.Fa "const nvlist_t *params"
.Fc
.Ft void
.Fo iov_uinit
.Fa "if_ctx_t ctx"
.Fc
.Ft void
.Fo ifdi_vflr_handle
.Fa "if_ctx_t ctx"
.Fc
.Ft int
.Fo ifdi_vf_add
.Fa "if_ctx_t ctx"
.Fa "uint16_t vfnum"
.Fa "const nvlist_t *params"
.Fc
.Ss "Optional Functions"
.Ft void
.Fo ifdi_link_intr_enable
.Fa "if_ctx_t ctx"
.Fc
.Ss "Optional Service Routines"
.Ft void
.Fo ifdi_timer
.Fa "if_ctx_t ctx"
.Fc
.Ft void
.Fo ifdi_watchdog_reset
.Fa "if_ctx_t ctx"
.Fc
.Ss "Additional Functions"
.Ft void
.Fo ifdi_led_func
.Fa "if_ctx_t ctx"
.Fa "int onoff"
.Fc
.Ft int
.Fo ifdi_sysctl_int_delay
.Fa "if_ctx_t ctx"
.Fa "if_int_delay_info_t iidi"
.Fc
.Ft int
.Fo ifdi_i2c_req
.Fa "if_ctx_t ctx"
.Fa "struct ifi2creq *req"
.Fc
.Ft int
.Fo ifdi_get_rss_key
.Fa "if_ctx_t ctx"
.Fa "struct ifrsskey *key"
.Fc
.Ft int
.Fo ifdi_set_rss_key
.Fa "if_ctx_t ctx"
.Fa "struct ifrsskey *key"
.Fc
.Ft int
.Fo ifdi_get_rss_hash
.Fa "if_ctx_t ctx"
.Fa "struct ifrsshash *hash"
.Fc
.Ft int
.Fo ifdi_get_rss_table
.Fa "if_ctx_t ctx"
.Fa "struct ifrsstable *table"
.Fc
.Ft int
.Fo ifdi_set_rss_table
.Fa "if_ctx_t ctx"
.Fa "struct ifrsstable *table"
.Fc
.Sh FUNCTIONS
The above named functions are device dependent configuration functions.
These routines are registered with iflib by the driver and are called from the
corresponding iflib function to configure device specific functions and
registers.
.Ss Device Dependent Functions
.Ss Soft Queue Setup and Teardown
.Bl -ohang -offset indent
.It Fn ifdi_tx_queues_alloc
Mandatory function that is called during iflib_attach to allocate transmit
queues.
vaddrs and paddrs are arrays of virtual and physical addresses respectively of
the hardware transmit queues.
ntxqs is the number of queues per qset.
ntxqsets is the number of qsets.
.It Fn ifdi_rx_queues_alloc
Mandatory function that is called during iflib_attach to allocate receive
queues.
vaddrs and paddrs are arrays of virtual and physical addresses respectively of
the hardware receive queues.
nrxqs is the number of queues per qset.
nrxqsets is the number of qsets.
The qset count is not guaranteed to be a power of two, so reduce an
RSS bucket to a queue with a modulo, not an AND mask, or some queues
are starved.
.It Fn ifdi_queues_free
Mandatory function that frees the allocated queues and associated transmit
buffers.
.It Fn ifdi_txq_setup
Optional function for each transmit queue that handles device specific
initialization.
.It Fn ifdi_rxq_setup
Optional function for each receive queue that handles device specific
initialization.
.El
.Ss Device Setup and Teardown
.Bl -ohang -offset indent
.It Fn ifdi_attach_pre
Mandatory function implemented by the driver to perform any attach logic that
procedes interrupt and queue allocation, queue setup, and interrupt assignment.
.It Fn ifdi_attach_post
Mandatory function implemented by the driver to perform any attach logic that
occurs after ifdi_attach_pre, and iflib's queue setup and MSI/MSIX(X) or legacy
interrupt assignment.
.It Fn ifdi_detach
Mandatory function that frees any resources allocated by the driver in
ifdi_attach_pre and ifdi_attach_post.
.It Fn ifdi_vlan_register
Optional function called by the VLAN config eventhandler.
.Va vtag
is the new VLAN tag.
.It Fn ifdi_vlan_unregister
Optional function called by the VLAN unconfig eventhandler.
.It Fn ifdi_power_prepare
Optional function called before iflib performs the terminal stop used for
detach, suspend, or shutdown.
The
.Fa event
argument is one of
.Dv IFLIB_POWER_DETACH ,
.Dv IFLIB_POWER_SUSPEND ,
or
.Dv IFLIB_POWER_SHUTDOWN .
Drivers should use this hook only to establish policy which must precede the
stop and must not start, stop, or alter queue DMA; the default implementation
does nothing.
If it returns an error, it must undo any partial policy change before
returning.
.It Fn ifdi_suspend
Optional function called after iflib has stopped queue DMA and drained its
private configuration taskqueue.
It performs suspend-specific firmware, wake, PHY, and low-power work.
An error is returned to the bus, and iflib attempts to resume the stopped
interface.
.It Fn ifdi_shutdown
Optional function called after the same terminal stop and taskqueue drain as
.Fn ifdi_suspend .
Shutdown errors are returned without attempting rollback.
.It Fn ifdi_resume
Optional function that restores suspend-specific device state while the
datapath remains stopped.
This function is also called to roll back a failed suspend.
It must not assume that a PCI power-state transition or configuration-space
restore has occurred since
.Fn ifdi_suspend .
After it succeeds, iflib initializes the datapath exactly once when the
interface is administratively up and leaves an administratively-down interface
stopped.
.El
.Ss Device Configuration Functions
.Bl -ohang -offset indent
.It Fn ifdi_init
Mandatory function that will initialize and bring up the hardware.
For example, it will reset the chip and enable the receiver unit.
Iflib marks the interface running after the callback returns successfully;
the driver must not modify the driver flags itself.
If initialization cannot complete, the driver must leave the hardware stopped
or in a state in which
.Fn ifdi_stop
can safely quiesce it, and call
.Fn iflib_init_failed
before returning.
Iflib treats this report conservatively and invokes the driver stop method
before retrying initialization or releasing queue mappings.
.It Fn ifdi_stop
Mandatory function that performs a terminal stop and disables all traffic on
the interface.
The driver must stop DMA before returning; iflib releases the TX and RX
buffers after the callback.
The method commonly issues a global reset and may also put the PHY or device
into its administratively-down state.
.It Fn ifdi_multi_set
Programs the interfaces multicast addresses
.It Fn ifdi_media_status
Media Ioctl Callback.
Function is called whenever the user queries the status of the interface using
.Xr ifconfig 8 .
The driver sets the appropriate link type and speed in ifmr->ifm_active.
.It Fn ifdi_mtu_set
Sets the mtu interface to the value of the second function parameter mtu.
.It Fn ifdi_media_change
Function is called when the user changes speed/duplex using the media/mediaopt
option with
.Xr ifconfig 8 .
It is not called while the device is suspending or suspended; iflib rejects
such a media change with
.Er EBUSY .
.It Fn ifdi_promisc_set
Enables or disables promisc settings depending upon the flags value.
.Va flags
contains the interface's
.Xr ifnet 9
flags.
.It Fn ifdi_get_counter
Returns the value for counter cnt depending upon counter type.
.It Fn ifdi_update_admin_status
Sets the link_up state to TRUE or FALSE depending upon the OS link state.
A real check of the hardware only happens with a link interrupt.
.It Fn ifdi_media_set
Need to define
.El
.Ss Interrupt Enable/Disable
.Bl -ohang -offset indent
.It Fn ifdi_intr_enable
Mandatory function that enables all interrupts.
.It Fn ifdi_intr_disable
Mandatory function that disables all interrupts.
.It Fn ifdi_queue_intr_enable
Mandatory function that enables interrupts on queue qid.
.It Fn iov_init
Initialize num_vfs VFs.
.It Fn io_uninit
Tear down the context for all VFs.
.It Fn ifdi_vflr_handle
Handle any VFs that have reset themselves via a Function Level Reset (FLR).
.It Fn ifdi_vf_add
Set parameters in params in VF vfnum.
.El
.Ss Service Routines
.Bl -ohang -offset indent
.It Fn ifdi_timer
Optional timer routine that will be run every 500ms.
.It Fn ifdi_watchdog_reset
Optional function to run when a transmit queue is hung.
.El
.Ss Additional Functions
.Bl -ohang -offset indent
.It Fn ifdi_led_func
.It Fn ifdi_sysctl_int_delay
.It Fn ifdi_i2c_req
.It Fn ifdi_get_rss_key
Optional function that reports the hash function, key length and key the
device is programmed with, for
.Dv SIOCGIFRSSKEY .
.It Fn ifdi_set_rss_key
Optional function that programs a hash key, for
.Dv SIOCSIFRSSKEY .
iflib has checked that the requested function is
.Dv RSS_FUNC_TOEPLITZ
and that the length fits the buffer, and has cleared the bytes past the
key; reject a length the device cannot use with
.Er EINVAL .
The key must survive
.Fn ifdi_init .
.It Fn ifdi_get_rss_hash
Optional function that reports the hash function and the
.Dv RSS_TYPE_
selections the device is programmed with, for
.Dv SIOCGIFRSSHASH .
.It Fn ifdi_get_rss_table
Optional function that stores the receive queue of each indirection table
entry in
.Va ifrt_table
and sets
.Va ifrt_nentries
to
.Va isc_rss_table_size ,
for
.Dv SIOCGIFRSSTABLE .
iflib fills in
.Va ifrt_nqueues .
.It Fn ifdi_set_rss_table
Optional function that programs the indirection table, for
.Dv SIOCSIFRSSTABLE .
iflib has checked that
.Va ifrt_nentries
equals
.Va isc_rss_table_size
and that every entry names an existing receive queue.
The table must survive
.Fn ifdi_init .
.El
.Pp
The five RSS functions run with the context lock held.
A driver that does not provide one returns
.Er EOPNOTSUPP ;
one whose state is not available yet should return
.Er ENXIO .
iflib itself returns
.Er ENXIO
for all five until
.Fn ifdi_attach_post
has completed, so a driver need not track that.
iflib clears a query's buffer past the interface name before the driver
fills it, and checks a request before calling a setter, so a malformed
request is refused with
.Er EINVAL
whether or not the driver provides the setter; probe for support with a
query.
A driver implementing the table functions must set
.Va isc_rss_table_size ,
which iflib takes as the table length.
.Sh SEE ALSO
.Xr ifconfig 8 ,
.Xr iflibdi 9 ,
.Xr iflibtxrx 9 ,
.Xr ifnet 9
.Sh AUTHORS
This manual page was written by
.An Nicole Graziano
